# StairsAttrRiserAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsAttrRiserAngle Property
ParameterTypeId Class See Also
---
"Riser Angle"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsAttrRiserAngle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsAttrRiserAngle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsAttrRiserAngle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace